app/Http/Controllers/FormController.php

    private function generateFormObject(Form $srcForm)
    {
        // start building new form container
        $form = [];
        $form['id'] = $srcForm->id;
        $form['name'] = $srcForm->name;
        $form['description'] = $srcForm->description;
        $form['published'] = false;

        // get source form's sections
        $srcSections = $srcForm->sections()->get();
---
select * from `sections` where `sections`.`form_id` = 1 and `sections`.`form_id` is not null