app/Http/Controllers/FormController.php

select * from `sections` where `sections`.`form_id` = 1 and `sections`.`form_id` is not null
---
    private function generateForm(Form $srcForm): array
    {
        // start building new form container
        $form = [
            'id' => $srcForm->id,
            'name' => $srcForm->name,
            'description' => $srcForm->description,
            'published' => false,
        ];

        // get source form's sections
        $srcSections = $srcForm->sections()->get();